export const ACCORDION_DATA = [
  {
    question: 'Що я можу придбати у вашому магазині?',
    answer: `У нашому асортименті представлені вироби пастили та фріпсів.
              Пастила - це смаколик, виготовлений із фруктово-ягідного пюре.
              Висушений у дегідраторі за низьких температур, що дає змогу
              зберігати всі поживні речовини. Фріпси - це смачні та корисні
              чіпси із фруктових сматочків, виготовлені шляхом дегідрації без
              додавання цукру та консервантів.`
  },
  {
    question: 'Цукор є?',
    answer: `Так, але, це природній цукор, який міститься у фруктах та ягодах.
              Ми не додаємо жодних барвників чи консервантів. У складі тільки
              фрукти та ягоди. В деяких видах пастили присутні додатки - горіхи,
              кокос, м'ята та ін.`
  },
  {
    question: "Що таке 'Йогуртові цукерки'?",
    answer: `Йогуртові цукерки - це та сама пастила, але з додаванням у склад
              білого йогурту. Має ніжний молочний смак. Скручена у зручні
              рогалики-цукерки.`
  },
  {
    question: 'Як правильно зберігати?',
    answer: `Наші продукти не люблять вологи! Термін зберігання класичної
              пастили на основі яблука – 6 місяців, йогуртової пастили – 3
              місяці, фріпсів до 12 місяців. Краще за все для зберігання
              підходить темне місце при кімнатній температурі 16-22 градусів.
              Уникайте потрапляння прямих сонячних променів. Для прикладу це
              може бути закрита поличка, або шафа на вашій кухні. Для тари
              підійде скляна банка, лоток, чи відерко з щільною кришкою. Для
              збереження початкового смаку краще зберігати кожен смак в окремій
              тарі.`
  },
  {
    question: 'Який термін доставки?',
    answer: `Все залежить від вибору служби доставки. В середньому 2-5 днів без
              урахування святкових та вихідних. Потурбуйтесь про завчасне
              замовлення, якщо бажаєте отримати товари до конкретної дати.`
  },
  {
    question: 'Чому саме Sushka.in.ua?',
    answer: `Чому ми? Тому, що у нас домашнє крафтове виробництво, в якому ми
              використовуємо домашні та органічні фрукти та ягоди. Саме це дає
              змогу споживати наші смаколики дітям від 6 місяців, дорослим, що
              слідкують за вагою, спортсменам, вагітним та мамам на ГВ, і всім
              хто полюбляє солоденьке. У складі немає - цукру, барвників та
              консервантів, натомість, є усі необхідні вітаміни для якісного
              функціонування організсу. Більш ніж за рік нашої праці ми отримали
              сотні позитивних відгуків про наші продукти, що надають ще більше
              мотивації.`
  }
]
