/* eslint-disable max-lines */
import { useEffect } from 'react'
import styles from './ConditionsPage.module.scss'

const ConditionsPage = () => {
  useEffect(() => {
    window.scroll({
      top: 0,
      behavior: 'instant'
    })
  }, [])

  return (
    <div className={styles.container}>
      <h2 className={styles.conditionTitle}>
        Умови та Положення використання вебсайту Sushka.in.ua.
      </h2>
      <div className={styles.conditionTextWrapper}>
        <p className={styles.conditionText}>
          Вдячні Вам, що завітали до нашого вебсайту. Тому, будь ласка, уважно
          ознайомтесь з даним документом, адже, використання сайту свідчить про
          те, що прийняли наведені Положення та Умови.
        </p>

        <h3 className={styles.conditionAnchor}>Терміни та визначення</h3>
        <ol className={styles.numberList}>
          <li id="1.1">
            Інтернет-магазин – сайт, розташований за адресою (вставити ссилку
            сайту), на якому Покупець може ознайомитися з Товарами, їхніми
            описами, цінами, вибрати певний Товар, спосіб його оплати і
            доставки, а також оформити Замовлення.
          </li>
          <li id="1.2">
            Покупець – дієздатна фізична особа, що укладає договір
            купівлі-продажу Товару з продавцем шляхом оформлення Замовлення в
            Інтернет-магазині.
          </li>
          <li id="1.3">
            Зареєстрований покупець – Покупець, що надав Продавцеві Персональну
            інформацію про себе (прізвище, ім’я та по батькові, номер телефону,
            адресу електронної пошти), яка може бути використана для оформлення
            Замовлення неодноразово (детальніше про використання Персональної
            інформації читайте на сторінці «Політика конфіденційності»).
          </li>
          <li id="1.4">
            Продавець – ФОП Потапович Інна Сергіївна, що укладає договір
            купівлі-продажу Товарів через Інтернет-магазин шляхом прийняття
            Замовлення від Покупця за допомогою технічних та програмних засобів
            Інтернет-магазину.
          </li>
          <li id="1.5">
            Товар – об’єкт купівлі-продажу (річ), що не вилучений та не
            обмежений у цивільному обігу України і представлений до продажу в
            Інтернет-магазині шляхом розміщення у відповідному розділі сайту.
          </li>
          <li id="1.6">
            Замовлення – оформлений належним чином запит Покупця на купівлю
            Товарів, представлених в Інтернет-магазині, відправлений через сайт
            або повідомлений Продавцю телефоном.
          </li>
        </ol>
        <h3 className={styles.conditionAnchor}>Загальні положення</h3>
        <ol className={styles.numberList}>
          <li id="2.1">
            Ці Правила користування Інтернет-магазином (далі – Правила)
            визначають порядок продажу товарів через Інтернет-магазин, та
            відповідно до Цивільного Кодексу України є офіційною публічною
            офертою Продавця, адресованою Покупцям (при спільному згадуванні
            також іменовані «Сторони», а окремо — «Сторона»).
          </li>
          <li id="2.2">
            Кожна Сторона гарантує іншій Стороні, що володіє необхідною право- і
            дієздатністю, а відповідно і всіма правами та повноваженнями,
            необхідними і достатніми для придбання товарів через
            Інтернет-магазин (вставити ссилку на сайт) (далі – Магазин).
          </li>
          <li id="2.3">
            Магазином можуть вільно користуватися лише особи, що досягли 18
            років. Будь-яка особа, що не досягла віку 18 років, може
            користуватися Магазином лише за згоди своїх батьків чи опікунів.
          </li>
          <li id="2.4">
            Покупець погоджується з цими Правилами шляхом здійснення наступних
            обов’язкових дій:
            <ul className={styles.unnumerableList}>
              <li>
                Оформленням замовлення на Товар в порядку, передбаченому цими
                Правилами;
              </li>
              <li>
                Прийняття та погодження Покупцем умов, встановлених цими
                Правилами, яке здійснюється під час реєстрації на сайті Продавця
                – створення облікового запису.
              </li>
            </ul>
          </li>
          <li id="2.5">
            Продавець залишає за собою право вносити зміни до цих Правил. Чинна
            версія Правил завжди розміщена на сайті (ссилка на сайт).
          </li>
        </ol>

        <h3 className={styles.conditionAnchor}>Інтелектуальна власність</h3>
        <ol className={styles.numberList}>
          <li id="3.1">
            Вся інформація, яка містить на вебсайті Інтернет-магазину ( ссилка),
            будь-який комп’ютерний код, який містить Вебсайт, елементи Вебсайту
            належить Продавцю на праві інтелектуальної власності. Ви не можете
            копіювати, відтворювати, передавати, публікувати, або будь-яким
            іншим чином поширювати вебсторінки або матеріали Вебсайту, або
            комп`ютерні коди або елементи Вебсайту, окрім як для особистого
            користування, без попередньої письмової згоди Продавця.
          </li>
        </ol>

        <h3 className={styles.conditionAnchor}>Реєстрація на сайті</h3>
        <ol className={styles.numberList}>
          <li id="4.1">
            Для оформлення замовлення Покупцю необхідно зареєструватися на
            сайті. Реєстрація на сайті відбувається шляхом створення облікового
            запису. Після реєстрації на сайті, для Покупця стає можливим
            користування Обліковим записом.
          </li>
          <li id="4.2">
            Покупець несе особисту відповідальність за точність, правильність та
            правдивість інформації, яка вказується Покупцем під час реєстрації
            на сайті.
          </li>
          <li id="4.3">
            Кожен, хто реєструється та здійснює покупки на вебсайті в
            інтернет-магазині, надає свої персональні дані та погоджується на їх
            обробку на умовах, визначених Політикою конфіденційності.
          </li>
          <li id="4.4">
            Під час реєстрація на вебсайті в Інтернет-магазині – створення
            облікового запису, Покупець приймає умови Політики конфіденційності,
            Правила та умови використання сайту шляхом:
            <ul className={styles.unnumerableList}>
              <li>Натиснення кнопки «Створити обліковий запис».</li>
            </ul>
          </li>
        </ol>

        <h3 className={styles.conditionAnchor}>
          Порядок оформлення замовлення та придбання Товарів в
          Інтернет-магазині.
        </h3>

        <ol className={styles.numberList}>
          <li id="5.1">
            Замовлення приймаються через сайт (ссилка). Покупець оформляє
            замовлення через Особистий кабінет.
          </li>
          <li id="5.2">
            При оформленні замовлення, Покупець повинен вказати наступну
            інформацію:
            <ul className={styles.unnumerableList}>
              <li>Прізвище та ім’я Покупця або отримувача замовлення;</li>
              <li>Адресу доставки замовлення;</li>
              <li>Адресу електронної пошти;</li>
              <li>Контактні дані.</li>
            </ul>
          </li>
          <li id="5.3">
            Вебсайт Інтернет-магазину містить інформацію щодо характеристик
            Товарів, цін на Товари, матеріалів, з яких вони виготовлені та
            приблизну наявність цих Товарів у Продавця.
          </li>
          <li id="5.4">
            Продавець не несе відповідальності за розміщення не точної чи
            неповної інформації про Товар.
          </li>
          <li id="5.5">
            Під час замовлення Товару Покупець обирає Товар із запропонованого
            Продавцем асортименту, указуючи, зокрема, розмір, смак, за
            необхідності надаючи іншу конкретну інформацію та зазначаючи
            кількість замовлених Товарів.
          </li>
          <li id="5.6">
            Після вибору Товару Покупцеві потрібно натиснути значок «Додати в
            Kошик».
          </li>
          <li id="5.7">
            Товар переміщується в Кошик, який стає видимим після натискання
            значка кошика на панелі у верхній частині вікна сайту. Покупець може
            перейти до Кошика, натиснувши кнопку «Оформити замовлення», яка
            активує сторінку, де відображаються всі Товари в кошику. Покупець
            може додавати чи видаляти, змінювати кількість Товарів, розміщених в
            «Кошику».
          </li>
          <li id="5.8">
            Для придбання Товарів, які розміщені в Кошику, Покупець повинен
            натиснути на кнопку перейти до «Оформлення замовлення». Після вибору
            опції «Оформлення замовлення» відкриється сторінка, на якій Покупець
            повинен увести дані, необхідні для виконання транзакції та
            відвантаження замовлених Товарів.
          </li>
          <li id="5.9">
            Вибравши спосіб доставки (за вказаною адресою) та ввівши всі
            необхідні реквізити (включаючи платіжні реквізити, якщо це
            необхідно), слід обрати спосіб оплати. Покупець може вибрати оплату
            готівкою під час отримання замовлення або онлайн-платіж (оплата
            карткою шляхом переказу через PayU) у випадку, якщо можливість
            онлайн-оплати, передбачено Продавцем.
          </li>
          <li id="5.10">
            Закінчення оформлення замовлення підтверджується натисненням на
            кнопку «Оформити замовлення» яке свідчить про підтвердження Покупцем
            згоди з усіма умовами, викладеними на цьому вебсайті
            Інтернет-магазину.
          </li>
          <li id="5.11">
            Одразу після розміщення замовлення Покупець отримає повідомлення
            електронною поштою з підтвердженням замовлення на адресу, яку він
            вказав у реквізитах для входу. Повідомлення електронної пошти
            містить індивідуальний номер замовлення, який можна використовувати,
            щоб, наприклад, перевірити стан замовлення.
          </li>
          <li id="5.12">
            На будь-якій стадії розміщення замовлення до моменту його оформлення
            Покупець може скасувати замовлення, припинивши процес замовлення та
            покинувши сторінку замовлення. Замовлення, розміщення якого Покупець
            не завершив, не приймається Покупцем до виконання.
          </li>
          <li id="5.13">
            Покупець може самостійно скасувати замовлення протягом 15 хвилин
            після його розміщення на вкладці «Мої замовлення» панелі Покупця,
            натиснувши кнопку «Скасувати замовлення» поруч із замовленням. В
            подальшому, замовлення можна скасувати лише з використанням
            контактної форми (форми зворотного зв’язку), розміщену на вебсайті
            Інтернет- магазину. Після входу в інтернет-магазин Покупець отримує
            доступ до додаткових опцій на панелі Покупця, зокрема: історії
            замовлень, перегляду стану останнього замовлення, збереження адрес
            доставки, отримання з магазину найновішої інформації про Товар.
          </li>
          <li id="5.14">
            Представник Sushka.in.ua може зв’язатися з Покупцем електронною
            поштою або за вказаним номером телефону для з’ясування будь-яких
            незрозумілих аспектів, підтвердження замовлення або з будь-яких
            інших питань, пов’язаних з обробкою замовлення.
          </li>
          <li id="5.15">
            Відповідно до статті 8 Закону України «Про захист прав споживачів»
            під час продажу товару продавець зобов’язаний видати платіжний
            документ (чек, рахунок, тощо) встановленої форми із зазначенням дати
            продажу покупцю (клієнту). Він підтверджує факт покупки. Видача
            платіжного документа може бути реалізована у вигляді електронного
            платіжного документа (e-document) на номер клієнта або на адресу
            електронної пошти, надану клієнтом. Платіжний документ повинен бути
            оформлений або створений в електронній формі не пізніше моменту
            відправлення товару.
          </li>
          <li id="5.16">
            Детальні умови щодо порядку оплати Товарів вказані в розділі
            «Оплата» на вебсайті Інтернет-магазину.
          </li>
        </ol>
        <h3 className={styles.conditionAnchor}>
          Вартість Товарів та способи оплати замовлення.
        </h3>
        <ol className={styles.numberList}>
          <li id="6.1">
            Ціни, зазначені на вебсайті Інтернет-магазину, вказуються в гривнях.
          </li>
          <li id="6.2">
            Ціна Товару не включає вартість доставки, яка залежить від обраного
            способу доставки Товару та адреси доставки.
          </li>
          <li id="6.3">
            Ціна на Товар, зазначена на сайті на момент оформлення замовлення,
            включає у себе всі розрахунки податків та є кінцевою ціною,
            обов’язковою як для Покупця, так і для Продавця. Продавець може
            змінювати ціну Товару в односторонньому порядку до моменту
            оформлення замовлення. Після оформлення замовлення ціна не може
            змінюватися, незалежно від будь-яких коригувань цін, зроблених в
            Sushka.in.ua і будь-яких спеціальних пропозицій або продажів із
            знижками.
          </li>
          <li id="6.4">
            Sushka.in.ua. залишає за собою право в односторонньому порядку
            змінювати ціни на Товари, які доступні на вебсайті
            Інтернет-магазину, починати продаж нових Товарів, пропонувати та
            скасовувати спеціальні пропозиції на вебсайті Інтернет-магазину або
            змінювати їх.
          </li>
          <li id="6.5">
            Оплата Товарів здійснюється готівкою при отриманні Товару.
          </li>
          <li id="6.6">
            Оплата при отриманні Товару здійснюється шляхом передачі готівкових
            коштів кур’єру під час отримання Товару (посилки).
          </li>
          <li id="6.7">
            Зверніть увагу! Інтернет-магазин ніколи не надсилає Покупцеві
            повідомлення про те, що рахунок для оплати змінився і що потрібно
            здійснити переказ на рахунок Продавця. Якщо Покупець отримує
            електронний лист такого змісту, не потрібно відповідати на нього або
            здійснювати жодних платежів. Натомість потрібно переслати електронне
            повідомлення в незміненому вигляді на адресу (електронна адреса
            нашох фірми)
          </li>
        </ol>

        <h3 className={styles.conditionAnchor}>Способи та вартість доставки</h3>
        <ol className={styles.numberList}>
          <li id="7.1">
            Товари доставляються лише в межах України. Товари доставляються
            кур’єрською службою Нова Пошта та Укрпошта.
          </li>
          <li id="7.2">
            Якщо обрано оплату Товару після доставки, обробка замовлення
            починається відразу після його оформлення.
          </li>
          <li id="7.3">
            У випадку, якщо Покупець обрав доставку за вказаною адресою та
            вибрані Товари є в наявності, час доставки складає від 3 (трьох) до
            11 (одинадцяти) робочих днів після успішного розміщення замовлення
            (в залежності від регіону та виду доставки). Час доставки може бути
            довшим для продажів за зниженими, акційними цінами або спеціальних
            кампаній. Час доставки може бути збільшений Продавцем односторонньо
            з різних причин про що Продавець повідомляє Покупців на вебсайт
            Інтернет-магазину.
          </li>
          <li id="7.4">
            Доставка здійснюються лише у робочі дні. Доставка не здійснюється у
            вихідні та святкові, неробочі дні.
          </li>
          <li id="7.5">
            Вартість доставки кожного Замовлення розраховується індивідуально,
            виходячи з ваги Товару, регіону та способу доставки. Вартість
            доставки сплачується Покупцем окремо та не включається у вартість
            Товару.
          </li>
          <li id="7.6">
            У випадку, якщо Товар відсутній або замовлення неможливо обробити з
            будь-якої іншої причини, Продавець негайно звертається до Покупця з
            пропозиціями можливих рішень. У такому випадку строк доставки Товару
            збільшується та починає обраховуватися з моменту надходження Товару
            на склад.
          </li>
          <li id="7.7">
            Датою отримання Товару вважається дата підписання Покупцем
            товаросупровідних документів, які підтверджують факт отримання його
            Покупцем.
          </li>
          <li id="7.8">
            Право власності на Товар, ризик випадкової втрати чи пошкодження
            Товару переходить до Покупця з моменту отримання ним Товару і
            підписання Покупцем товаросупровідних документів, що підтверджують
            отримання Товару.
          </li>
          <li id="7.9">
            Детальні умови та строки доставки Товар вказані в розділі «Доставка»
            на вебсайті Інтернет-магазину.
          </li>
          <li id="7.10">
            Переконливо просимо перевіряти зовнішній вигляд і комплектність
            замовлення в момент отримання. У разі нестачі (крадіжки) або
            пошкодження товару необхідно написати претензію до перевізника (Нова
            Пошта, Укрпошта). Не підписуйте декларацію про отримання посилки, що
            має явні ознаки пошкодження. Гроші будуть повернуті Вам після
            розгляду претензії. Також просимо повідомляти нам про такі випадки,
            це допоможе уникнути непорозумінь.
          </li>
        </ol>

        <h3 className={styles.conditionAnchor}>
          Повернення Товару неналежної якості:
        </h3>
        <ol className={styles.numberList}>
          <li id="8.1">
            Під товаром неналежної якості мається на увазі товар невідповідного
            смаку, запаху, або ж терміну придатності. Отриманий Товар повинен
            відповідати опису на Сайті. Відмінність елементів дизайну, або
            оформлення від заявлених в описі на Сайті не є ознакою неналежної
            якості Товару та / або неможливості використання його за
            призначенням.
          </li>
          <li id="8.2">
            Зовнішній вигляд і комплектність Товару, а також комплектність
            усього Замовлення повинні бути перевірені Одержувачем в момент
            доставки Товару.
          </li>
          <li id="8.3">
            Після отримання Замовлення претензії до зовнішніх дефектів товару,
            його кількості, комплектності та товарного вигляду не приймаються.
          </li>
          <li id="8.4">
            Якщо Покупцеві був переданий Товар неналежної якості та інше не було
            заздалегідь обумовлено Продавцем, Покупець має право скористатися
            положеннями ст. 8 «Права споживача у разі придбання ним товару
            неналежної якості» Закону України «Про захист прав споживачів».
          </li>
          <li id="8.5">
            Повернення грошових коштів здійснюється за допомогою повернення
            вартості оплаченого Товару поштовим, банківським переказом (через
            ПриватБанк), а також шляхом перерахування на банківську карту (карта
            повинна бути емітована на території України; валюта карти - гривня).
            Спосіб буде визначений при передзвоні працівника Call-центру “Смак
            Життя”.
          </li>
          <li id="8.6">
            Продавець не відповідає за недоліки Товару, якщо вони виникли після
            його передачі Покупцеві внаслідок порушення Покупцем правил
            користування або зберігання товару, дій третіх осіб, або
            непереборної сили.
          </li>
        </ol>

        <h3 className={styles.conditionAnchor}>
          Правила поведінки користувачів
        </h3>
        <ol className={styles.numberList}>
          <li id="9.1">
            Користувачам заборонено використовувати будь-які матеріали сайту без
            згоди правовласників. Для правомірного використання матеріалів
            Сайту, необхідне отримання письмової згоди від адміністрації сайту
            на використання матеріалів.
          </li>
          <li id="9.2">
            Цитування будь-яких матеріалів сайту на будь-яких сторонніх ресурсах
            дозволяється за умови наявності клікабельного посилання на наш Сайт.
          </li>
          <li id="9.3">
            Користувач погоджується з тим, що Адміністрація Сайту не несе
            відповідальності за відвідування і використання ним зовнішніх
            ресурсів, посилань, які можуть міститися на сайті.
          </li>
          <li id="9.4">
            Користувач погоджується з тим, що Адміністрація Сайту не несе
            відповідальності перед Користувачем, у зв’язку з будь-якими
            можливими або дійсними втратами чи збитками, пов’язаними з будь-яким
            контентом Сайту (зовнішні посилання або інші контакти Користувача, у
            які він вступив, використовуючи розміщену на сайті інформацію чи
            посилання на зовнішні ресурси).
          </li>
          <li id="9.5">
            Заборонено розміщувати персональні дані третіх осіб, інформацію
            комерційного характеру, яка стосується особистості користувача.
          </li>
          <li id="9.6">
            Заборонено залишати будь-які повідомлення та чинити будь-які інші
            дії, заборонені чинним законодавством України.
          </li>
          <li id="9.7">
            Заборонено залишати на Сайті повідомлення наступного змісту:
            <ul className={styles.subNumberList}>
              <li id="9.7.1">
                Заклики до агресії, насилля та дій, що провокують порушення
                порядку, встановленого Конституцією України;
              </li>
              <li id="9.7.2">
                Прямі та завуальовані образи кого-небудь, зокрема за
                національною, етнічною, расовою або релігійною приналежністю, а
                також шовіністичні висловлювання.
              </li>
              <li id="9.7.3">Нецензурні висловлювання;</li>
              <li id="9.7.4">
                Реклама, комерційні повідомлення, повідомлення, що не стосуються
                тематики ресурсу.
              </li>
              <li id="9.7.5"> Спам.</li>
            </ul>
          </li>
        </ol>

        <h3 className={styles.conditionAnchor}>
          Процедура розгляду скарг та спорів
        </h3>
        <ol className={styles.numberList}>
          <li id="10.1">
            Скарги на недоліки товару можна подати впродовж двох років з дня
            покупки.
          </li>
        </ol>
      </div>
    </div>
  )
}

export default ConditionsPage
