/* eslint-disable max-lines */
import { useEffect } from 'react'
import styles from './ConditionsPage.module.scss'

const PrivacyPolicyPage = () => {
  useEffect(() => {
    window.scroll({
      top: 0,
      behavior: 'instant'
    })
  }, [])

  return (
    <div className={styles.container}>
      <h2 className={styles.conditionTitle}>Політика конфіденційності</h2>
      <div className={styles.conditionTextWrapper}>
        <p className={styles.conditionText}>
          Персональні дані - відомості чи сукупність відомостей про фізичну
          особу, яка ідентифікована або може бути конкретно ідентифікована.
          Управління цим Сайтом здійснюється ФОП Потапович Інна Сергіївна та
          командою менеджерів, що зареєстрована і діє відповідно і згідно
          законодавства України (далі - і/або «Адміністрація»). Ми з повагою і
          великою відповідальністю ставимося до конфіденційної (персональної)
          інформації всіх осіб, які відвідали Сайт. А тому Адміністрація сайту
          робить все, щоб захистити і зберегти конфіденційність персональних
          даних наших користувачів. Ми працюємо відкрито і прозоро зі своїми
          клієнтами, тому Адміністрацією сайту було прийнято рішення про
          розміщення докладного опису процесу обробки персональних даних при
          використанні нашого сайту Sushka.in.ua. При виникненні питань, які
          стосуються конфіденційності персональних даних, Ви можете зв`язатися з
          Адміністрацією Сайту за контактними даними, які вказані нижче.
        </p>

        <h3 className={styles.conditionAnchor}>ВИЗНАЧЕННЯ ТЕРМІНІВ.</h3>
        <ol className={styles.numberList}>
          <li id="1.1">
            У політиці конфіденційності застосовуються наступні терміни:
            <ul className={styles.subNumberList}>
              <li id="1.1.1.">
                Адміністрація інтернет-магазину – це уповноважені фахівці, які
                можуть керувати сайтом. Вони діють від імені компанії.
                Адміністрація створює і обробляє персональні дані. Вона визначає
                цілі того, чому виконується подібна обробка. Визначається і сам
                склад особистої інформації, яка буде оброблена. Адміністрацією
                виконуються і інші операції, пов’язані з початковими даними.
              </li>
              <li id="1.1.2.">
                Персональна інформація – це будь-які дані про користувача, які
                побічно або безпосередньо відносяться до конкретної фізичної
                особи. Це суб’єкт персональної інформації.
              </li>
              <li id="1.1.3.">
                Обробка персональних даних – це всілякі дії або ж їх сукупність,
                які здійснюються із застосуванням засобів автоматизації. Можливо
                і виконання операцій без їх використання. Сюди відносять: запис
                і збір особистих даних, зберігання, накопичення, витяг і т.д. Не
                виключається знищення, видалення і блокування.
              </li>
              <li id="1.1.4.">
                Конфіденційність персональної інформації – це обов’язкова до
                виконання адміністрацією сайту дія. Це відбувається при
                отриманні доступу до особистої інформації. Адміністрація
                зобов’язана зробити все, щоб не допустити поширення даних без
                особистої згоди користувача. Не виключається присутність і інших
                законних підстав для цього.
              </li>
              <li id="1.1.5.">
                Користувач інтернет-магазину – це певна особа, яка отримує
                доступ до конкретного сайту. Це відбувається з використанням
                мережі Інтернет.
              </li>
              <li id="1.1.6.">
                Cookies – це не дуже великий фрагмент інформації, який
                відправляється сервером і зберігається на ПК самого користувача.
                Його браузер постійно пересилає сервера під виглядом
                спеціального HTTP-запиту. Це відбувається при кожній або
                черговій спробі відкрити Інтернет-сторінку.
              </li>
              <li id="1.1.7.">
                IP-адреса – це оригінальна мережева адреса, яка була збудована
                зі спеціального протоколу під виглядом IP.
              </li>
            </ul>
          </li>
        </ol>
        <h3 className={styles.conditionAnchor}>
          Збір та використання персональних даних та іншої інформації.
        </h3>
        <ol className={styles.numberList}>
          <li id="2.1">
            Використання Сайту не вимагає реєстрації та/або авторизації та
            безпосереднього надання персональних даних, які можуть
            ідентифікувати Вас, крім випадку передбаченого п. 2.2. Політики.
          </li>
          <li id="2.2">
            На свій розсуд, для більшої зручності використання Сайту, Ви можете
            авторизуватись на Сайті шляхом - ведення електронної пошти та за
            номером телефону.
          </li>
          <li id="2.3">
            При використанні Сайту ми можемо здійснювати автоматичний збір
            інформації, пов’язаної із використанням Вами Сайту.
          </li>
          <li id="2.4">
            Користувач дає свою згоду Адміністрації сайту на обробку отриманої
            інформації, включаючи збір, систематизацію, накопичення, зберігання,
            уточнення (оновлення, виправлення), використання, поширення,
            знеособлення, блокування, знищення персональних даних, зазначених в
            анкеті, з метою заходів, спрямованих на формування бази даних
            учасників, складання статистичної звітності, проведення
            маркетингових досліджень, а також здійснення взаємодії з
            користувачем, в тому числі по мережах електрозв`язку, включаючи
            напрям SMS-повідомлень і електронних листів, до відкликання такої
            згоди.
          </li>
          <li id="2.5">
            Користувач підтверджує свою згоду з тим, що Адміністрація сайту має
            право взаємодіяти з Користувачем шляхом здійснення прямих контактів
            з допомогою різних засобів зв`язку, включаючи, але не обмежуючись:
            поштова розсилка, електронна пошта, мережа Інтернет і ін.
          </li>
          <li id="2.6">
            Персональні дані, дозволені до обробки в рамках цієї Політики
            конфіденційності, включають в себе, але не обмежуються наступною
            інформацією:
            <ul className={styles.subNumberList}>
              <li id="2.6.1.">ПІБ Користувача;</li>
              <li id="2.6.2.">контактний телефон Користувача;</li>
              <li id="2.6.3.">адреса електронної пошти (e-mail);</li>
              <li id="2.6.4.">адреса доставки Товару;</li>
              <li id="2.6.5.">місце проживання Користувача.</li>
            </ul>
          </li>

          <li id="2.7">
            Персональну інформацію Користувача Sushka.in.ua. використовує для
            таких цілей:
            <ul className={styles.subNumberList}>
              <li id="2.7.1.">
                ідентифікації Користувача, зареєстрованого на Сайті, для
                оформлення замовлення і (або) спосіб оплати, укладення Договору
                купівлі-продажу товару дистанційним способом з Sushka.in.ua.
              </li>
              <li id="2.7.2.">
                надання Користувачеві ефективної клієнтської підтримки;
              </li>
              <li id="2.7.3.">
                надання Користувачеві персоналізованих Сервісів;
              </li>
              <li id="2.7.4.">
                зв`язку з Користувачем, в тому числі напрямок повідомлень,
                запитів та інформації, що стосуються використання Сервісів,
                надання послуг, а також обробки запитів і заявок від
                Користувача;
              </li>
              <li id="2.7.5.">
                поліпшення якості Послуг, зручності їх використання, розробка
                нових Сервісів і послуг;
              </li>
              <li id="2.7.6.">
                надання інформації про товари, послуги, що реалізуються
                Sushka.in.ua, про рекламні акції, що проводяться, відповідей на
                запити, а також виконання своїх зобов`язань перед споживачами
                товарів (послуг);
              </li>
              <li id="2.7.7.">
                проведення статистичних та інших досліджень на основі
                знеособлених даних.
              </li>
            </ul>
          </li>
        </ol>

        <h3 className={styles.conditionAnchor}>
          СПОСОБИ І ТЕРМІНИ ОБРОБКИ ПЕРСОНАЛЬНИХ ДАНИХ
        </h3>
        <ol className={styles.numberList}>
          <li id="3.1">
            Обробка персональних даних Користувача здійснюється без обмеження
            терміну, будь-яким законним способом, в тому числі в інформаційних
            системах персональних даних з використанням засобів автоматизації
            або без використання таких засобів.
          </li>
          <li id="3.2">
            Користувач погоджується з тим, що Адміністрація сайту має право
            передавати персональні дані третім особам, зокрема, кур`єрським
            службам, платіжним системам, організаціями поштового зв`язку,
            операторам електрозв`язку, виключно з метою виконання замовлення
            Користувача, оформленого на Сайті (ссилка), включаючи доставку
            Товару.
          </li>
        </ol>

        <h3 className={styles.conditionAnchor}>ПРАВА КОРИСТУВАЧІВ</h3>
        <ol className={styles.numberList}>
          <li id="4.1">
            Користувачі мають право в будь-який час дізнатися, чи були збережені
            їх Персональні дані, і можуть звертатися до Адміністрації сайту, щоб
            дізнатися їх зміст і походження, перевірити їх достовірність, або
            попросити їх доповнити, анулювати, оновити або виправити або
            перетворити в формат, що забезпечує анонімність, або блокувати
            будь-які дані, що зберігаються в порушення закону, а також виступити
            проти їх обробки за всіма без винятку законних підставах. Відповідні
            запити слід направляти Адміністрації сайту за адресою, вказаною в
            контактних відомостях на сайті.
          </li>
        </ol>

        <h3 className={styles.conditionAnchor}>БЕЗПЕКА ПЕРСОНАЛЬНИХ ДАНИХ</h3>

        <ol className={styles.numberList}>
          <li id="5.1">
            Sushka.in.ua, вживає необхідних організаційних і технічних заходів
            для захисту персональної інформації Користувача від неправомірного
            або випадкового доступу, знищення, перекручення, блокування,
            копіювання, поширення, а також від інших неправомірних дій третіх
            осіб.
          </li>
          <li id="5.2">
            Дана Політика конфіденційності поширюється тільки на Сайт (ссилка).
            Якщо по посиланнях, розміщеним на сайті останнього, Користувач зайде
            на ресурси третіх осіб, Sushka.in.ua, за його дії відповідальності
            не несе.
          </li>
          <li id="5.3">
            Персональні дані Користувача можуть бути використані в юридичних
            цілях в суді або на етапах, що ведуть до можливого звернення до суду
            в зв`язку з тим, що сайт або послуги використовувалися неналежним
            чином.
          </li>
          <li id="5.4">
            Користувач обізнаний про те, що Адміністрація сайту може бути
            змушена повідомити персональні дані на вимогу органів державної
            влади.
          </li>
        </ol>
        <h3 className={styles.conditionAnchor}>ПОЛІТИКА ЩОДО COOKIE</h3>
        <ol className={styles.numberList}>
          <li id="6.1">
            Сайт збирає інформацію про відвідування Вами наших вебсайтів з метою
            отримання статистики відвідувань і ефективності їх використання,
            формування персонального підходу і адаптації до інтересів кожного
            користувача. Ми робимо це за допомогою різних технологій, одна з
            яких - cookie-файли. Це дані, які вебсайт може відправити вашому
            браузеру, і вони будуть збережені на вашому комп`ютері для подальшої
            ідентифікації його вебсайтом.
          </li>
          <li id="6.2">
            Cookie-файли використовуються для оцінки ефективності вебсайтів
            (наприклад, для вимірювання кількості відвідувачів і тривалості їх
            перебування на сайті), виявлення найбільш цікавих і відвідуваних тим
            і сторінок, а також для забезпечення зручності навігації та
            користування сайтом, без збору будь-якої персональної інформації.
            Також cookie-файли можуть бути використані для формування
            персонального підходу на основі вже наявного досвіду взаємодії
            користувача з сайтом і його перевагами. З плином часу ця інформація
            дозволяє поліпшити досвід.
          </li>
        </ol>

        <h3 className={styles.conditionAnchor}>
          ПРАВИЛА РЕДАГУВАННЯ ПОЛІТИКИ КОНФІДЕНЦІЙНОСТІ
        </h3>
        <ol className={styles.numberList}>
          <li id="7.1">
            Sushka.in.ua. має право періодично змінювати цю Політику
            конфіденційності. Зміни до Політики конфіденційності вступають в
            силу після їх публікації на Сайті.
          </li>
        </ol>
      </div>
    </div>
  )
}

export default PrivacyPolicyPage
